// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "小溪哦",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "又是一年生日了",  // 同上...
        "我一如既往地忙得火烧屁股",
        "你又不让送快递嘛",
        "鲜花放不住蛋糕会长胖",
        "直到你想让我好好写祝福",
        "我才知道你最在乎的",
        "是我内心的爱",
        "我爱你哦，与日俱增地爱你",
        "赵利听说我们准备见家长",
        "有点落寞有点羡慕",
        "谁不渴望有甜甜的",
        "稳稳的",
        "温馨的",
        "长久的",
        "爱情呢？",
        "给你过的第五个生日了",
        "这次人又没在一块",
        "端午节后一天嘛",
        "每逢佳节倍思亲",
        "小溪是我的亲人呢",
        "让我很想念很想念的亲人",
        "不管是有你在身边",
        "还是心上的你在远方",
        "你都是我心灵的港湾",
        "感谢小溪带给我的",
        "幸福",
        "快乐",
        "再一定要加一条好运",
        "希望我们后面的各种",
        "生日",
        "节日",
        "纪念日",
        "都能依偎在一起过",
        "当然",
        "要说上最认真的一句：",
        "祝小溪生日快乐！",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
//         "心爱的小可爱": "./imgs/xiaokeai.png",
        // "今天是你的生日": "./imgs/birthday.jpg",
    },
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "开始",
        play: "音乐",
        bannar_coming: "颜色",
        balloons_flying: "好像少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐",
        story: "A MESSAGE FOR YOU",
    }
};
